courses/sok/00-upoznavanje/upoznavanje.org
#+TITLE: Softverski obrasci i komponente
#+SUBTITLE: Upoznavanje sa predmetom
#+EXPORT_FILE_NAME: index.html
#+SETUPFILE: ../../courses-startup.org

* Opšte informacije

- Broj ESPB: 4
- Fond časova: 3+3
- Predmetni nastavnik: dr Igor Dejanović, igord na uns.ac.rs
- Predmetni asistenti: 
  - MSc Željko Ivković, zeljkoi na uns.ac.rs
  - MSc Miloš Simić, milos.simic na uns.ac.rs

- Materijali su dostupni na sajtu https://enastava.ftninformatika.com/ i na ovom
  sajtu
- Komunikacija se obavlja preko sajta https://enastava.ftninformatika.com/
- Informacije o ispitima:
  - https://groups.google.com/d/forum/dejanovic-ispiti

* Cilj predmeta

- Osposobljavanje za primenu komponentno baziranog razvoja (/Component-Based
  Development - CBD/)
- Osposobljavanje za prepoznavanje i primenu softverskih obrazaca
- Savladavanje modernih tehnologija baziranih na komponentnom razvoju
- Integracija postojećih, slobodno dostupnih komponenti i rešenja u cilju
  izgradnje složenih softverskih proizvoda

* Struktura ocene

| Praktični deo | Teorija |
|---------------+---------|
|      <c>      |   <c>   |
|      60%      |   40%   |

* Projekat

- Timski rad - timovi od 4 ± 1 studenta
- Obavezna upotreba sistema za kontrolu verzija (git)
- Obavezna upotreba sistema za upravljanje projektom (GitLab)

* Projekat - raspodela bodova

| Aktivnost                 | Bodovi |
|---------------------------+--------|
|                           |  <c>   |
| Model komponenti          |   10   |
| Implementacija komponenti |   20   |
| Implementacija projekta   |   18   |
| Git aktivnost             |   6    |
| Gitlab aktivnost          |   6    |
|---------------------------+--------|
| *Ukupno*                  | *60*   |

* Ukus SOK-a - prezentacije starijih generacija

- Gen. 2007/08 – Generički IDE za razvoj (/Code Editor – CodEd/): Swing,
  OSGI(Apache Felix)
  
    - Multi-level tim – cela nastavna grupa je veliki tim koji se deli na
      podtimove
    - Podrška za proizvoljne programske jezike (specijalizacija za Javu): custom
      parser, syntax highlighting, code outline, search/replace...
      
* Ukus SOK-a - prezentacije starijih generacija

- Gen. 2008/09 – Extensible Graph Analysis and Transformation Engine (ExGATE):
  Swing, OSGI (Eclipse Eqinox).

  - Pojedinačni timovi
  - Generiči editor za kreiranje, analizu, transformaciju i vizuelizaciju
    grafova
  - Podrška za pretrage grafova, layouting, generisanje...

* Prezentacija ExGERM tima

 - https://www.youtube.com/embed/qOWJA0aa_JM
 - https://www.youtube.com/embed/eBd7YdmPZt4

* Generacija 2011-2015

- /Ex/ tensible /P/ latform for /S/ tructure /V/ isualization and /N/ avigation
  (/ExPreSsiVeNess/)
- Vizualizacija i navigacija nad strukturama tipa grafa
- Promenjivi modeli: razne vrste POJO objektnih grafova
- Promenjive konkretne sintakse
- Brz pregled i navigacija
- Operacije: pan, point zoom in/out, tree outline, bird-view, filter,
  search, dobijanje detalja o tekućem objektu itd
- Opciono: konzola za upravljanje platformom: izmena sintaksi,
    izmena modela itd

- Tehnologije:
  - Integraciona platforma – Eclipse Equinox (OSGi)
  - GUI – Eclipse Rich Client Platform (RCP) + SWT/JFace
  - Vizualizacija grafova – GEF (Draw2d, Zest)
  - I naravno: git i GitLab

* Generacija 2016-

- /Ex/ tensible /P/ latform for /S/ tructure /V/ isualization and /N/ avigation
  (/ExPreSsiVeNess/)
- Vizualizacija i navigacija nad strukturama tipa grafa
- Promenjivi modeli: razne vrste POPO objektnih grafova
- Promenjive konkretne sintakse
- Brz pregled i navigacija
- Operacije: pan, point zoom in/out, tree outline, bird-view, filter,
  search, dobijanje detalja o tekućem objektu itd
- Opciono: konzola za upravljanje platformom: izmena sintaksi,
    izmena modela itd
- Tehnologije:
  - Integraciona platforma – Python setuptools
  - Server strana: [[https://www.djangoproject.com/][Django]]
  - Baza: [[https://www.mongodb.com/][MongoDB]], [[https://www.sqlite.org/][SQLite]] ili [[https://www.postgresql.org/][PostgreSQL]]
  - GUI – HTML, CSS, JavaScript
  - Vizualizacija grafova – [[https://d3js.org/][D3.js]]
  
* Literatura

- E. Gamma, R. Helm, R. Johnson, and J. M. Vlissides, /Design Patterns: Elements
  of Reusable Object-Oriented Software/, Addison-Wesley Professional, 1994
- C. Szyperski, /Component Software: Beyond Object-Oriented Programming/,
  Addison-Wesley Longman Publishing Co., Inc., 2002
- Allen B. Downey, [[http://greenteapress.com/wp/think-python-2e/][Think Python 2nd Edition]]
- [[https://docs.python.org/3/tutorial/index.html][The Python Tutorial]]
- [[http://setuptools.readthedocs.io/en/latest/pkg_resources.html][Package Discovery and Resource Access using pkg_resources]]
